extends Node
class_name Unit


var lessons_array = ["a", "b", "c"]
var path_to_icon;


func _ready() -> void:
	pass



# სად შევინახო ლესსონების მიმდევრობა?

# მიზანი: როცა დააჭერ სტარტ ლესსონს ჩაიტვირთება 3 ასო რომლის ყველა ლესონი უნდა გაიარო
# პრობლემა: როცა დააჭერ სტარტს როგორ უნდა მივხვდეთ რომელი 3 ასო ჩაიტვირთოს
#		ამისთვის რა მინდა? სადღაც უნდა შევინახო ამაზე ინფო.
#		მაგალითად პრიორიტეტების ჯსონ ფაილი სადაც ჩამოწერილია ანბანი და თითოეულ ასოს აქვს
#		პრიორიტეტების მიმდევრობა მაგალითად:
#		ა x, y, სადაც:
#		x იქნება პრიორიტეტი ანუ რომელ გაკვეთილში უნდა იყოს და 
#		y იქნება რამდენჯერ აქვს პრაქტიკა გავლილი ალბათ
#		მერე ლექციის დაწყების დროს გადავივლი ამ სიას და ალგორითმი ასეთი იქნება
#		პრიორიტეტი მინიმალური რომელსაც აქვს ის 3 აირჩევა, ან პრიორიტეტი + პრაქტიკა (თუ დაემთხვა პრიორიტეტით ავირჩიოთ)
#		გადარბენის მერე ავირჩევთ ამ მაიმუნობას და ჩავწერთ რამე 3 ელემენტიან მაპში
#		ამ მაპს ექნება თითო ასოსთვის 3 (ან 4) ქაუნთერი? ან ბული თითო თითო ტესტის ტიპისთვის
#		ხოდა რანდომად ავიღოთ ამ მასივის ელემენტი და ვნახოთ რეები აქვს შევსებული პირველი რაც არ აქვს შევსებული იმას ჩავტვირთავთ
#		მერე მეორეს და როცა ყველა შეივსება ამოვაგდებთ ასეთ ელემენტს და ყველა რო დამთავრდება დავბრუნდებით უკან.
#		და ეს მიმდევრობით ვქნათ ტესტები (ხმოვანი იკონკით a = ა ხმით და რაღაცა? ეს მოსაფიქრებელია)


# საქმე:
#	1. ჯსონიდან კითხვა უნდა ვისწავლო
#	2. საიდან ჩაიტვირთება ჯსონი? ჯსონ ლოადერი მინდა

